Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: As a simple test case, we'll profile the ``wget`` of a fairly large file, which is a minimally interesting case because it has both file and network I/O aspects, and at least in the case of standard Yocto images, it's implemented as part of BusyBox, so the methods we use to analyze it can be used in a similar way to the whole host of supported BusyBox applets in Yocto::
it_it: Come semplice caso di test, profilamo il comando ``wget`` di un file piuttosto grande, un caso minimamente interessante perché include aspetti di I/O sia di file che di rete e, almeno nel caso delle immagini Yocto standard, è implementato come parte di BusyBox, quindi i metodi che utilizziamo per analizzarlo possono essere usati in modo simile a tutta la gamma di applet BusyBox supportate in Yocto::

source: As an actual example, consider the relevant content from the :yocto_git:`/meta-yocto/tree/meta-yocto-bsp/conf/ </meta-yocto/tree/meta-yocto-bsp/conf/>` directory of the ``meta-yocto-bsp`` BSP layer:
it_it: A titolo di esempio, si consideri il contenuto rilevante della directory :yocto_git:`/meta-yocto/tree/meta-yocto-bsp/conf/ </meta-yocto/tree/meta-yocto-bsp/conf/>` del layer BSP ``meta-yocto-bsp``:

source: As an alternative, you can add the same feature from within your distro :term:`configuration file` with the associated :term:`EXTRA_IMAGE_FEATURES` variable, as in::
it_it: In alternativa, è possibile aggiungere la stessa funzionalità dal :term:`configuration file` della propria distribuzione utilizzando la variabile :term:`EXTRA_IMAGE_FEATURES` associata, come segue::

source: As an example, a dynamically created task when creating a particular image type would take the following form::
it_it: Ad esempio, un task creato dinamicamente durante la creazione di un particolare tipo di immagine avrebbe la seguente forma::

source: As an example, consider a case with in-line Python where BitBake is not able to figure out dependencies. When running in debug mode (i.e. using ``-DDD``), BitBake produces output when it discovers something for which it cannot figure out dependencies. The Yocto Project team has currently not managed to cover those dependencies in detail and is aware of the need to fix this situation.
it_it: Ad esempio, si consideri un caso con codice Python inline in cui BitBake non è in grado di individuare le dipendenze. Quando si esegue in modalità debug (ovvero utilizzando ``-DDD``), BitBake produce un output quando rileva qualcosa per cui non riesce a individuare le dipendenze. Il team di Yocto Project non è ancora riuscito a trattare in dettaglio queste dipendenze ed è consapevole della necessità di risolvere questa situazione.

source: As best it can, opkg maintains backwards compatibility with ipkg and conforms to a subset of Debian's policy manual regarding control files.
it_it: Per quanto possibile, opkg mantiene la compatibilità con le versioni precedenti di ipkg e si conforma a un sottoinsieme del manuale delle policy di Debian relative ai file di controllo.

source: As described earlier in the ":ref:`structure-build-tmp-sysroots`" section, beginning with the 2.3 release of the Yocto Project, the OpenEmbedded build system builds each recipe in its own work directory (i.e. :term:`WORKDIR`). The path to the work directory is constructed using the architecture of the given build (e.g. :term:`TUNE_PKGARCH`, :term:`MACHINE_ARCH`, or "allarch"), the recipe name, and the version of the recipe (i.e. :term:`PE`\ ``:``\ :term:`PV`\ ``-``\ :term:`PR`).
it_it: Come descritto in precedenza nella sezione ":ref:`structure-build-tmp-sysroots`", a partire dalla versione 2.3 di Yocto Project, il sistema di build OpenEmbedded compila ogni ricetta nella propria directory di lavoro (ovvero :term:`WORKDIR`). Il path alla directory di lavoro viene costruito utilizzando l'architettura della build specificata (ad esempio, :term:`TUNE_PKGARCH`, :term:`MACHINE_ARCH` o "allarch"), il nome della ricetta e la versione della ricetta (ad esempio, :term:`PE`\ ``:``\ :term:`PV`\ ``-``\ :term:`PR`).

source: As explained in the previous :ref:`ref-manual/release-process:Major and Minor Release Cadence` section, a new release comes out every six months.
it_it: Come spiegato nella precedente sezione :ref:`ref-manual/release-process:Major and Minor Release Cadence`, una nuova release viene rilasciata ogni sei mesi.

source: As far as bootloaders are concerned, :term:`Initramfs` and "initrd" images are still copied to RAM in the same way. That's why most most bootloaders refer to :term:`Initramfs` images as "initrd" or "init RAM disk".
it_it: Per quanto riguarda i bootloader, le immagini :term:`Initramfs` e "initrd" vengono comunque copiate nella RAM nello stesso modo. Per questo motivo, la maggior parte dei bootloader si riferisce alle immagini :term:`Initramfs` come "initrd" o "init RAM disk".

source: As instructed by the installer script, you will have to source the tools environment setup script::
it_it: Come indicato dallo script di installazione, dovrai eseguire lo script di configurazione dell'ambiente degli strumenti::

source: As mentioned briefly in the previous section and also in the ":ref:`overview-manual/development-environment:git workflows and the yocto project`" section, the Yocto Project maintains source repositories at :yocto_git:`/`. If you look at this web-interface of the repositories, each item is a separate Git repository.
it_it: Come accennato brevemente nella sezione precedente e anche nella sezione ":ref:`overview-manual/development-environment:git workflows and the yocto project`", Yocto Project gestisce i repository del codice sorgente all'indirizzo :yocto_git:`/`. Se si osserva questa interfaccia web dei repository, ogni elemento corrisponde a un repository Git separato.

source: As mentioned earlier in this section, the existence of at least one machine configuration file is what makes a layer a BSP layer as compared to a general or kernel layer.
it_it: Come accennato in precedenza in questa sezione, l'esistenza di almeno un file di configurazione della macchina è ciò che distingue un layer BSP da un layer generico o del kernel.

source: As mentioned previously, if data in the CVE database is wrong, it is recommended to fix those issues in the CVE database (NVD in the case of :term:`OpenEmbedded-Core (OE-Core)`) directly.
it_it: Come accennato in precedenza, se i dati nel database CVE sono errati, si consiglia di correggere tali problemi direttamente nel database CVE (NVD nel caso di :term:`OpenEmbedded-Core (OE-Core)`).

source: As mentioned previously, the :term:`OpenEmbedded-Core (OE-Core)` :term:`metadata` is the core of the Yocto Project. This metadata has several important subdivisions:
it_it: Come accennato in precedenza, i :term:`metadata` :term:`OpenEmbedded-Core (OE-Core)` sono il nucleo di Yocto Project. Questi metadati sono suddivisi in diverse sezioni importanti:

source: As mentioned, the build system takes the recipe and creates packages from the recipe's instructions. The resulting packages are related to the one thing the recipe is building but are different parts (packages) of the build (i.e. the main package, the doc package, the debug symbols package, the separate utilities package, and so forth). The build system splits out the packages so that you don't need to install the packages you don't want or need, which is advantageous because you are building for small devices when developing for embedded and IoT.
it_it: Come menzionato, il sistema di compilazione [build] prende la ricetta e crea i pacchetti in base alle istruzioni in essa contenute. I pacchetti risultanti sono correlati all'elemento principale che la ricetta sta compilando, ma costituiscono parti diverse (pacchetti) della compilazione (ovvero il pacchetto principale, quello di documentazione, il pacchetto con i simboli di debug, quello con le utilità separate e così via). Il sistema suddivide i pacchetti in modo da evitare l'installazione di componenti non desiderati o non necessari, il che rappresenta un vantaggio significativo quando si sviluppa per piccoli dispositivi in ambito embedded e IoT.

source: As our first attempt at profiling this workload, we'll just run ``perf record``, handing it the workload we want to profile (everything after ``perf record`` and any perf options we hand it --- here none, will be executed in a new shell). perf collects samples until the process exits and records them in a file named ``perf.data`` in the current working directory::
it_it: Come primo tentativo di profilazione di questo carico di lavoro, eseguiremo semplicemente ``perf record``, passandogli il carico di lavoro che vogliamo profilare (tutto ciò che segue ``perf record`` e le eventuali opzioni di perf che gli passiamo - in questo caso nessuna, verrà eseguito in una nuova shell). perf raccoglie campioni fino alla terminazione del processo e li registra in un file chiamato ``perf.data`` nella directory di lavoro corrente::

source: As shipped, Toaster is configured to use a specific set of releases. Of course, you can always configure Toaster to use any release. For example, you might want your project to build against a specific commit of any of the "out-of-the-box" releases. Or, you might want your project to build against different revisions of OpenEmbedded and BitBake.
it_it: Toaster è configurato per utilizzare un set specifico di release. Naturalmente, è sempre possibile configurare Toaster per utilizzare qualsiasi release. Ad esempio, si potrebbe voler compilare il progetto con una specifica commit di una qualsiasi delle release predefinite. Oppure, si potrebbe voler compilare il progetto con diverse revisioni di OpenEmbedded e BitBake.

source: As shipped, Toaster is configured to work with the following releases:
it_it: Nella configurazione di default, Toaster è compatibile con le seguenti versioni:

source: As with system passwords, the default credentials for accessing a web-based interface should not be the same across all devices. This is particularly true if the interface is enabled by default as it can be assumed that many end-users will not change the credentials.
it_it: Come per le password di sistema, le credenziali di default per accedere a un'interfaccia basata sul web non dovrebbero essere le stesse su tutti i dispositivi. Questo è particolarmente vero se l'interfaccia è abilitata di default, poiché si può presumere che molti utenti finali non modificheranno le credenziali.

source: As with the :ref:`structure-build-conf-local.conf` file, the source ``bblayers.conf.sample`` file used depends on the :term:`TEMPLATECONF` script variable, which defaults to :oecore_path:`meta/conf/templates/default` . Because the script variable points to the source of the ``bblayers.conf.sample`` file, this implies that you can base your build from any layer by setting the variable in the top-level build environment setup script as follows::
it_it: Come per il file :ref:`structure-build-conf-local.conf`, il file sorgente ``bblayers.conf.sample`` utilizzato dipende dalla variabile di script :term:`TEMPLATECONF`, il cui valore predefinito è :oecore_path:`meta/conf/templates/default`. Poiché la variabile di script punta al file sorgente ``bblayers.conf.sample``, ciò implica che è possibile basare la build su qualsiasi layer impostando la variabile nello script di configurazione dell'ambiente di build di livello superiore come segue::

source: As yet another layer on top of that, KernelShark provides a GUI that allows users to start and stop traces and specify sets of events using an intuitive interface, and view the output as both trace events and as a per-CPU graphical display. It directly uses trace-cmd as the plumbing that accomplishes all that underneath the covers (and actually displays the trace-cmd command it uses, as we'll see).
it_it: Come ulteriore livello di controllo, KernelShark fornisce un'interfaccia grafica che consente agli utenti di avviare e interrompere le tracce e specificare set di eventi tramite un'interfaccia intuitiva, e di visualizzare l'output sia come eventi di traccia che come visualizzazione grafica per CPU. Utilizza direttamente trace-cmd come strumento interno per realizzare tutto ciò (e, come vedremo, visualizza anche il comando trace-cmd che utilizza).

source: As you can see, ``perf stat`` gives us a nice easy way to get a quick overview of what might be happening for a set of events, but normally we'd need a little more detail in order to understand what's going on in a way that we can act on in a useful way.
it_it: Come si può vedere, ``perf stat`` ci offre un modo semplice e veloce per ottenere una panoramica di ciò che potrebbe accadere in relazione a una serie di eventi, ma normalmente avremmo bisogno di maggiori dettagli per comprendere appieno la situazione e poter intervenire in modo efficace.

source: As you can see, the ``function_graph`` display is much easier to follow. Also note that in addition to the function calls and associated braces, other events such as scheduler events are displayed in context. In fact, you can freely include any tracepoint available in the trace events subsystem described in the next section by just enabling those events, and they'll appear in context in the function graph display. Quite a powerful tool for understanding kernel dynamics.
it_it: Come si vede, la visualizzazione di ``function_graph`` è molto più facile da seguire. Inoltre, oltre alle chiamate di funzione e alle parentesi graffe associate, vengono visualizzati anche altri eventi, come gli eventi dello scheduler, nel loro contesto. È possibile includere liberamente qualsiasi punto di tracciamento disponibile nel sottosistema degli eventi di tracciamento descritto nella sezione successiva, semplicemente abilitando tali eventi, che appariranno nel contesto della visualizzazione del grafico delle funzioni. Uno strumento davvero potente per comprendere le dinamiche del kernel.

source: As you can see, this does not prevent :term:`BitBake` from continuing, but the real task is executed instead of re-using the shared state.
it_it: Come si può notare, questo non impedisce a :term:`BitBake` di proseguire, ma viene eseguito il task reale invece di riutilizzare lo shared state.

source: Aside from broad architecture support, the Yocto Project fully supports a wide range of devices emulated by the Quick EMUlator (QEMU).
it_it: Oltre a un ampio supporto architetturale, Yocto Project supporta pienamente una vasta gamma di dispositivi emulati da Quick EMUlator (QEMU).

source: Assuming this directory and the temporary directory (:term:`TMPDIR`) are empty, let's run the ``create_recipe_spdx`` task of the ``gettext-minimal-native`` recipe:
it_it: Supponendo che questa directory e la directory temporanea (:term:`TMPDIR`) siano vuote, eseguiamo il task ``create_recipe_spdx`` della ricetta ``gettext-minimal-native``:

source: At a minimum, the ``README`` file must contain a list of dependencies, such as the names of any other layers on which the BSP depends and the name of the BSP maintainer with his or her contact information.
it_it: Il file ``README`` deve contenere, come minimo, un elenco delle dipendenze, inclusi i nomi di eventuali altri layer da cui dipende il BSP e il nome del manutentore del BSP con i relativi recapiti.

source: At a minimum, the ``README`` file should contain the following:
it_it: Come minimo, il file``README`` deve contenere quanto segue:

source: At build time the :ref:`ref-classes-sbom-cve-check` class will also throw warnings about ``Unpatched`` CVEs (when :term:`SBOM_CVE_CHECK_SHOW_WARNINGS` is set to "1"):
it_it: In fase di compilazione, la classe :ref:`ref-classes-sbom-cve-check` genererà anche warning relativi alle CVE ``Unpatched`` CVEs (quando :term:`SBOM_CVE_CHECK_SHOW_WARNINGS` è impostato su "1"):

source: At least 140 Gbytes of free disk space, though much more will help to run multiple builds and increase performance by reusing build artifacts.
it_it: Almeno 140 GB di spazio libero su disco, ma una quantità maggiore consentirà di eseguire più build e di migliorare le prestazioni riutilizzando gli artefatti della build.

source: At least 32 Gbytes of RAM, though a modern build host with as much RAM and as many CPU cores as possible is strongly recommended to maximize build performance.
it_it: Almeno 32 GB di RAM, sebbene per massimizzare le prestazioni di compilazione si raccomandi vivamente un host di compilazione moderno con la massima quantità di RAM e il maggior numero possibile di core CPU.

source: At the code level, there are multiple ways by which both the basehash and the dependent task hashes can be influenced. Within the BitBake configuration file, you can give BitBake some extra information to help it construct the basehash. The following statement effectively results in a list of global variable dependency excludes (i.e. variables never included in any checksum)::
it_it: A livello di codice, esistono diversi modi per influenzare sia il basehash che gli hash deli task dipendenti. Nel file di configurazione di BitBake, è possibile fornire a BitBake alcune informazioni aggiuntive per aiutarlo a costruire il basehash. La seguente istruzione genera di fatto un elenco di variabili globali da escludere dalle dipendenze (ovvero variabili che non vengono mai incluse in alcun checksum)::

source: At the end of the file, we also use this setting to implement ``runqemu`` support on the host machine.
it_it: Alla fine del file, utilizziamo questa impostazione anche per implementare il supporto per ``runqemu`` sulla macchina host.

source: At the lowest level of detail, we can dive down to the assembly level and see which instructions caused the most overhead in a function. Pressing ``Enter`` on the ``udhcpc_main`` function, we're again presented with a menu:
it_it: Al livello più basso Per entrare nel dettaglio, possiamo scendere al livello assembly e vedere quali istruzioni hanno causato il maggior overhead in una funzione. Premendo ``Enter`` sulla funzione ``udhcpc_main``, ci viene nuovamente mostrato un menu:

source: At the moment, we're not interested in the function tracer or some other tracer that might be in effect, so we first turn it off, but if we do that, we still need to turn tracing on in order to see the events in the output buffer::
it_it: Al momento, non siamo interessati al tracer di funzioni o ad altri tracer eventualmente attivi, quindi lo disattiviamo prima. Tuttavia, anche in questo caso, dobbiamo comunque riattivare il tracing per visualizzare gli eventi nel buffer di output::

source: At this stage, you are ready to send your patches via email. Here's the typical usage of ``git send-email``::
it_it: A questo punto, si è pronti per inviare le patch via email. Ecco l'utilizzo tipico di ``git send-email``::

source: Attach your SSH public key which usually named ``id_rsa.pub.``. If you don't have one generate it by running ``ssh-keygen -t rsa -b 4096 -C "your_email@example.com"``.
it_it: Allegare la propria chiave pubblica SSH, che di solito si chiama ``id_rsa.pub.``. Se non se ne possiede una, generala eseguendo ``ssh-keygen -t rsa -b 4096 -C "your_email@example.com"``.

source: AutoBuilder is based on `buildbot <https://buildbot.net/>`__.
it_it: AutoBuilder si basa su `buildbot <https://buildbot.net/>`__.

source: Automatically Added Runtime Dependencies
it_it: Dipendenze di Runtime Aggiunte Automaticamente

source: BSP Kernel Recipe Example
it_it: Esempio di Ricetta del Kernel BSP

source: BSP Layer
it_it: Layer BSP

source: BSP Layer Configuration Example
it_it: Esempio di Configurazione di un Layer BSP

source: BSP Layers
it_it: Layer BSP

source: BSP Licensing Considerations
it_it: Considerazioni sulle Licenze BSP

source: BSP Machine Configuration Example
it_it: Esempio di Configurazione della Macchina BSP

source: Basic Commands
it_it: Comandi Base

source: Basic Sysprof Usage
it_it: Utilizzo di Base di Sysprof

source: Basic Usage (with examples) for each of the Yocto Tracing Tools
it_it: Utilizzo di Base (con esempi) per ciascuno dei Tool di Tracing di Yocto

source: Basic blktrace Usage
it_it: Utilizzo di base di blktrace

source: Basic ftrace usage
it_it: Utilizzo di base di ftrace

source: Basic perf Usage
it_it: Utilizzo di Base di perf

source: Be careful when deleting files in this directory. You can safely delete old images from this directory (e.g. ``core-image-*``). However, the kernel (``*zImage*``, ``*uImage*``, etc.), bootloader and other supplementary files might be deployed here prior to building an image. Because these files are not directly produced from the image, if you delete them they will not be automatically re-created when you build the image again.
it_it: Fare attenzione quando si eliminano i file in questa directory. È possibile eliminare in sicurezza le vecchie immagini da questa directory (ad esempio, ``core-image-*``). Tuttavia, il kernel (``*zImage*``, ``*uImage*``, ecc.), il bootloader e altri file supplementari potrebbero essere distribuiti qui prima della creazione dell'immagine. Poiché questi file non vengono prodotti direttamente dall'immagine, se si eliminano non verranno ricreati automaticamente quando si creerà nuovamente l'immagine.

source: Be sure to always work in matching branches for both the selected BSP repository, the :term:`OpenEmbedded-Core (OE-Core)` and :term:`BitBake` repositories. For example, if you have checked out the "blacksail" branch of :term:`OpenEmbedded-Core (OE-Core)` and you are going to use ``meta-intel``, be sure to check out the "blacksail" branch of ``meta-intel``.
it_it: Si deve lavorare sempre su branch corrispondenti sia per il repository BSP selezionato, sia per i repository :term:`OpenEmbedded-Core (OE-Core)` e :term:`BitBake`. Ad esempio, se è stato effettuato il checkout del branch "blacksail" di :term:`OpenEmbedded-Core (OE-Core)` e si intende usare ``meta-intel``, si deve effettuare il checkout del branch "blacksail" di ``meta-intel``.

source: Be sure to provide values for host and port. If the server is alive, you will get the response HTML:
it_it: Assicurarsi di specificare host e porta. Se il server è attivo, si riceverà la seguente risposta HTML:

source: Be sure to provide values for host and port. The output is a JSON file that itemizes all builds in progress. This file includes the time in seconds since each respective build started as well as the progress of the cloning, parsing, and task execution. Here is sample output for a build in progress:
it_it: Assicurarsi di specificare host e porta. L'output è un file JSON che elenca tutte le build in corso. Questo file include il tempo in secondi trascorso dall'avvio di ciascuna build, nonché l'avanzamento della clonazione, dell'analisi e dell'esecuzione dei task. Ecco un esempio di output per una build in corso:

source: Be sure to provide values for host and port. The output is a JSON file that itemizes all complete builds, and includes build summary information. Here is sample output for a completed build:
it_it: Assicurarsi di specificare host e porta. L'output è un file JSON che elenca tutte le build completate e include informazioni di riepilogo. Ecco un esempio di output per una build completata:

source: Be sure to provide values for host, port, and ID. You can find the value for ID from the Builds Completed query. See the ":ref:`toaster-manual/reference:checking status of builds completed`" section for more information.
it_it: Assicurarsi di specificare host, porta e ID. È possibile trovare il valore di ID dalla query Builds Completed. Assicurarsi di specificare host, porta e ID. È possibile trovare il valore di ID dalla query ":ref:`toaster-manual/reference:checking status of builds completed`" per ulteriori informazioni.
